
## Plan Result (aat)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
* Update
  * module.fees-register-database-v15.azurerm_postgresql_flexible_server.pgsql_server


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.fees-register-database-v15.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fees-register-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fees-register-postgres-db-v15-aat"
        name                          = "fees-register-postgres-db-v15-aat"
      ~ public_network_access_enabled = false -> true
        tags                          = {
            "application"         = "fees-and-payments"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccfr-fees-register-app.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#cc-payments"
            "environment"         = "staging"
            "managedBy"           = "Fees/Pay"
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "fees-register-postgres-db-v15-aat-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "fees-register-postgres-db-v15-aat-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":579,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->